Autodesk.Revit.UI.IExternalCommandAvailability.IsCommandAvailable(Autodesk.Revit.UI.UIApplication,Autodesk.Revit.DB.CategorySet)
Implement this method to provide control over whether your external command is enabled or disabled.
Returns:  Indicates whether Revit should enable or disable the corresponding external command.
Remarks:
This callback will be called by Revit's user interface any time there is a contextual change. Therefore, the callback
must be fast and is not permitted to modify the active document and be blocking in any way.
applicationData:  An ApplicationServices.Application object which contains reference to Application
needed by external command.
selectedCategories:  An list of categories of the elements which have been selected in Revit in the active document,
or an empty set if no elements are selected or there is no active document.

Autodesk.Revit.UI.IExternalCommandAvailability
An interface that should be implemented to provide the implementation for a accessibility check for a Revit add-in External Command.
Remarks: This interface should share the same assembly with add-in External Command.

Autodesk.Revit.UI.IExternalCommandAvailability.IsCommandAvailable(Autodesk.Revit.UI.UIControlledApplication,Autodesk.Revit.DB.CategorySet)
Implement this method to provide control over whether your external command is enabled or disabled.
Returns:  Indicates whether Revit should enable or disable the corresponding external command.
Remarks:
This callback will be called by Revit's user interface any time there is a contextual change. Therefore, the callback
must be fast and is not permitted to modify the active document and be blocking in any way.
applicationData:  An ApplicationServices.Application object which contains reference to Application
needed by external command.
selectedCategories:  An list of categories of the elements which have been selected in Revit in the active document,
or an empty set if no elements are selected or there is no active document.

Autodesk.Revit.UI.IExternalCommandAvailability.IsCommandAvailable(Autodesk.Revit.VSTA.ApplicationEntryPoint,Autodesk.Revit.DB.CategorySet)
Implement this method to provide control over whether your external command is enabled or disabled.
Returns:  Indicates whether Revit should enable or disable the corresponding external command.
Remarks:
This callback will be called by Revit's user interface any time there is a contextual change. Therefore, the callback
must be fast and is not permitted to modify the active document and be blocking in any way.
applicationData:  An ApplicationServices.Application object which contains reference to Application
needed by external command.
selectedCategories:  An list of categories of the elements which have been selected in Revit in the active document,
or an empty set if no elements are selected or there is no active document.